In [39]:
import pandas as pd   #numpy, scify, cython, matplotlib, windows = set of application, Application Platform Interface
import numpy as np

In [40]:
K = np.array([1.8, 'f', 4, 'h', '6', 'g', 'n', 'r' ,'d'])
y = pd.Series(K) #How to create a series

In [41]:
y

0    1.8
1      f
2      4
3      h
4      6
5      g
6      n
7      r
8      d
dtype: object

In [42]:
x = ["Bed Prakash Das", "Ishan Mitra", "Tushan Mitra"] 
z = pd.DataFrame(x)   #creating a dataframe constructor on a list of strings

In [43]:
z

                 0
0  Bed Prakash Das
1      Ishan Mitra
2     Tushan Mitra

In [44]:
a = {"Bed Prakash Das":3, "Ishan Mitra":4, "Tushan Mitra":2}  #Creating a data dictonary
a1 = pd.Series(a)

In [45]:
a1[0]

3

In [46]:
a2 = pd.Series(4, index = [0, 1, 2])
a2

0    4
1    4
2    4
dtype: int64

In [47]:
a1.index #index and values of the data dictionary

Index(['Bed Prakash Das', 'Ishan Mitra', 'Tushan Mitra'], dtype='object')

In [48]:
a1.values #

array([3, 4, 2], dtype=int64)

In [49]:
a1.item

<bound method IndexOpsMixin.item of Bed Prakash Das    3
Ishan Mitra        4
Tushan Mitra       2
dtype: int64>

In [50]:
a2.items

<bound method Series.items of 0    4
1    4
2    4
dtype: int64>

In [51]:
a=pd.Series(data=[1,2,3,np.NaN])   
b=pd.Series(data=[4.9,8.2,5.6],index=['x','y','z'])   
c=pd.Series()   
print(a.empty,b.empty,c.empty)   
print(a.hasnans,b.hasnans,c.hasnans)   
print(len(a),len(b))   
print(a.count( ),b.count( ))

False False True
True False False
4 3
3 3

<ipython-input-51-33ff6ab7d731>:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  c=pd.Series()

In [52]:
a

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [53]:
b

x    4.9
y    8.2
z    5.6
dtype: float64

In [54]:
a.empty

False

In [55]:
c.empty

True

In [56]:
a.hasnans

True

In [57]:
b.hasnans

False

In [58]:
len(a)

4

In [59]:
len(b)

3

In [60]:
len(c)

0

In [61]:
b.count()

3

In [62]:
# program to tabulate the marks of three students in a dataframe
d = {'Name':["Bed Prakash Das", "Tushan Mitra", "Ishan Mitra"], 'Subject1':[45, 47, 48], 'Subject2':[47, 50, 44], 'Subject3':[44, 44, 44]}
s = pd.DataFrame(d)

In [63]:
s

              Name  Subject1  Subject2  Subject3
0  Bed Prakash Das        45        47        44
1     Tushan Mitra        47        50        44
2      Ishan Mitra        48        44        44

In [64]:
de = {'Name':["Bed Prakash Das", "Ishan Mitra", "Tushan Mitra"], 'Age':["No Data", 10, 6], 'Nickname':["No Data", "No Data", "No Data"]}
tab = pd.DataFrame(de)
pd.ExcelWriter('Name.xlsx', engine = 'xlsxwriter')

In [65]:
tab

              Name      Age Nickname
0  Bed Prakash Das  No Data  No Data
1      Ishan Mitra       10  No Data
2     Tushan Mitra        6  No Data

In [66]:
pd.Timestamp('2020,80,10')

Timestamp('2020-10-01 00:00:00')

In [67]:
pd.Timestamp('2020-10-08T16')

Timestamp('2020-10-08 16:00:00')

In [68]:
path = 'C:\Files\Ishan\Pandas.xlsx'
pd.ExcelWriter(path, engine = 'xlsxwriter')

In [69]:
import xlwt

In [70]:
df = pd.DataFrame({'Data': [10, 20, 30, 20, 15, 30, 45]})
w = pd.ExcelWriter('Pandas.xlsx', engine='xlsxwriter')
tab.to_excel(w, sheet_name='Sheet1')
w.save()